In [1]:
import pandas as pd
import numpy as np
import altair as alt
import glob
%matplotlib inline

In [2]:
files = glob.glob("../../data/processed/*.csv")
files

['../../data/processed/Ohare_Climate.csv',
 '../../data/processed/wnv.trap.date.species.csv',
 '../../data/processed/noaa.weather.stations.csv',
 '../../data/processed/google_trends.csv',
 '../../data/processed/noaa.weather.top20stn.csv',
 '../../data/processed/wnv.trap.date.csv',
 '../../data/processed/wnv.traps.csv']

In [3]:
input_data_list = [pd.read_csv(_) for _ in files]

/home/rahul/anaconda3/envs/tf/lib/python3.6/site-packages/IPython/core/interactiveshell.py:3185: DtypeWarning: Columns (10,12,14,16,18,20,22,24,26,30,32,38,40,42,54,78,82,84,88,90,92,94,96,98,100,102,104) have mixed types. Specify dtype option on import or set low_memory=False.
  if (yield from self.run_code(code, result)):

# `ohare_climate.csv`

In [4]:
input_data_list[0].head()

   Year   Month   Day   Max in F  Min in F  Rain Snow  Snow ground
0   2017       1     1      40.0      17.0     0    0          0.0
1   2017       1     2      40.0      25.0  0.11    0          0.0
2   2017       1     3      39.0      19.0     T    0          0.0
3   2017       1     4      19.0       7.0     0    0          0.0
4   2017       1     5      13.0       3.0     T    T          0.0

In [5]:
input_data_list[0].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 730 entries, 0 to 729
Data columns (total 8 columns):
Year           730 non-null int64
Month          730 non-null int64
Day            730 non-null int64
Max in F       729 non-null float64
Min in F       729 non-null float64
Rain           729 non-null object
Snow           729 non-null object
Snow ground    729 non-null float64
dtypes: float64(3), int64(3), object(2)
memory usage: 45.7+ KB

# `wnv.trap.date.species.csv`

In [6]:
input_data_list[1].head()

,Unnamed: 0,trap.name,lat,lng,lat.lng.src,satellite.ind,trap_type,date,mo,wk,...,erraticus.WnvPresent,pipiens.WnvPresent,pipiens_restuans.WnvPresent,restuans.WnvPresent,salinarius.WnvPresent,tarsalis.WnvPresent,territans.WnvPresent,unspecified.WnvPresent,any.WnvPresent,NumMosquitos
0,1,T220A,41.987054,-87.728398,CDPH,True,GRAVID,2008-08-26,8,35,...,False,False,True,False,False,False,False,False,True,0
1,2,T220A,41.987054,-87.728398,CDPH,True,GRAVID,2008-09-02,9,36,...,False,False,False,False,False,False,False,False,False,0
2,3,T220A,41.987054,-87.728398,CDPH,True,GRAVID,2008-09-09,9,37,...,False,False,True,False,False,False,False,False,True,0
3,4,T220A,41.987054,-87.728398,CDPH,True,GRAVID,2008-09-15,9,37,...,False,False,False,False,False,False,False,False,False,0
4,5,T220A,41.987054,-87.728398,CDPH,True,GRAVID,2008-09-19,9,38,...,False,False,False,False,False,False,False,False,False,0

In [7]:
input_data_list[1].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 122679 entries, 0 to 122678
Data columns (total 26 columns):
Unnamed: 0                     122679 non-null int64
trap.name                      122679 non-null object
lat                            122679 non-null float64
lng                            122679 non-null float64
lat.lng.src                    122679 non-null object
satellite.ind                  122679 non-null bool
trap_type                      122679 non-null object
date                           122679 non-null object
mo                             122679 non-null int64
wk                             122679 non-null int64
day.of.wk                      122679 non-null int64
day.of.wk.name                 122679 non-null object
location                       122679 non-null object
yr                             122679 non-null int64
species                        122679 non-null object
WnvPresent                     122679 non-null bool
erraticus.WnvPresent           122679 non-null bool
pipiens.WnvPresent             122679 non-null bool
pipiens_restuans.WnvPresent    122679 non-null bool
restuans.WnvPresent            122679 non-null bool
salinarius.WnvPresent          122679 non-null bool
tarsalis.WnvPresent            122679 non-null bool
territans.WnvPresent           122679 non-null bool
unspecified.WnvPresent         122679 non-null bool
any.WnvPresent                 122679 non-null bool
NumMosquitos                   122679 non-null int64
dtypes: bool(11), float64(2), int64(6), object(7)
memory usage: 15.3+ MB

# `noaa.weather.stations.csv`

In [8]:
input_data_list[2].head()

,STATION,NAME,location,LATITUDE,LONGITUDE,ELEVATION,nrows,min.date,max.date,AWND.n,...,SN53.n,SX53.n,tavg2.n,ZCTA5CE10,STATEFP,COUNTYFP,TRACTCE,BLKGRPCE,GEOID,community
0,US1ILCK0005,"HARWOOD HEIGHTS 1.0 ENE, IL US","(41.9704,-87.7879)",41.9704,-87.7879,192.0,446,2006-12-20,2009-01-17,0,...,0,0,0,60630,17.0,31.0,110300.0,4.0,1.703111e+11,JEFFERSON PARK
1,US1ILCK0007,"LANSING 1.7 SSE, IL US","(41.5428,-87.539)",41.5428,-87.5390,185.9,951,2006-12-01,2009-12-18,0,...,0,0,0,60411,17.0,31.0,828506.0,1.0,1.703183e+11,NaN
2,US1ILCK0010,"CHICAGO 3.0 N, IL US","(41.8798,-87.6823)",41.8798,-87.6823,181.1,165,2007-08-21,2010-09-16,0,...,0,0,0,60612,17.0,31.0,838000.0,1.0,1.703184e+11,NEAR WEST SIDE
3,US1ILCK0011,"OAK LAWN 1.6 NW, IL US","(41.7287,-87.7763)",41.7287,-87.7763,189.9,230,2007-02-21,2008-12-09,0,...,0,0,0,60453,17.0,31.0,822301.0,4.0,1.703182e+11,NaN
4,US1ILCK0012,"BRIDGEVIEW 1.3 NNW, IL US","(41.755,-87.8173)",41.7550,-87.8173,188.1,4290,2006-12-19,2018-12-30,0,...,0,0,0,60455,17.0,31.0,820501.0,3.0,1.703182e+11,NaN

In [9]:
input_data_list[2].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 303 entries, 0 to 302
Data columns (total 68 columns):
STATION      303 non-null object
NAME         303 non-null object
location     303 non-null object
LATITUDE     303 non-null float64
LONGITUDE    303 non-null float64
ELEVATION    303 non-null float64
nrows        303 non-null int64
min.date     303 non-null object
max.date     303 non-null object
AWND.n       303 non-null int64
DAPR.n       303 non-null int64
DASF.n       303 non-null int64
EVAP.n       303 non-null int64
FMTM.n       303 non-null int64
MDPR.n       303 non-null int64
MDSF.n       303 non-null int64
MNPN.n       303 non-null int64
MXPN.n       303 non-null int64
PGTM.n       303 non-null int64
PRCP.n       303 non-null int64
SN32.n       303 non-null int64
SN52.n       303 non-null int64
SNOW.n       303 non-null int64
SNWD.n       303 non-null int64
SX32.n       303 non-null int64
SX52.n       303 non-null int64
TAVG.n       303 non-null int64
TMAX.n       303 non-null int64
TMIN.n       303 non-null int64
TOBS.n       303 non-null int64
WDF2.n       303 non-null int64
WDF5.n       303 non-null int64
WDMV.n       303 non-null int64
WESD.n       303 non-null int64
WESF.n       303 non-null int64
WSF2.n       303 non-null int64
WSF5.n       303 non-null int64
WSFG.n       303 non-null int64
WT01.n       303 non-null int64
WT02.n       303 non-null int64
WT03.n       303 non-null int64
WT04.n       303 non-null int64
WT05.n       303 non-null int64
WT06.n       303 non-null int64
WT07.n       303 non-null int64
WT08.n       303 non-null int64
WT09.n       303 non-null int64
WT10.n       303 non-null int64
WT11.n       303 non-null int64
WT13.n       303 non-null int64
WT14.n       303 non-null int64
WT15.n       303 non-null int64
WT16.n       303 non-null int64
WT17.n       303 non-null int64
WT18.n       303 non-null int64
WT19.n       303 non-null int64
WT21.n       303 non-null int64
WT22.n       303 non-null int64
SN53.n       303 non-null int64
SX53.n       303 non-null int64
tavg2.n      303 non-null int64
ZCTA5CE10    303 non-null int64
STATEFP      263 non-null float64
COUNTYFP     263 non-null float64
TRACTCE      263 non-null float64
BLKGRPCE     263 non-null float64
GEOID        263 non-null float64
community    28 non-null object
dtypes: float64(8), int64(54), object(6)
memory usage: 161.0+ KB

# `google_trends.csv`

In [10]:
input_data_list[3].head()

,date,googtrend_sym_wnv,googtrend_deadbirds,googtrend_westnile,googtrend_mosq_bites
0,2004-01,0,0,5,0
1,2004-02,36,0,6,0
2,2004-03,0,5,8,0
3,2004-04,0,0,14,0
4,2004-05,0,0,20,0

In [11]:
input_data_list[3].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 181 entries, 0 to 180
Data columns (total 5 columns):
date                    181 non-null object
googtrend_sym_wnv       181 non-null int64
googtrend_deadbirds     181 non-null int64
googtrend_westnile      181 non-null int64
googtrend_mosq_bites    181 non-null int64
dtypes: int64(4), object(1)
memory usage: 7.1+ KB

# `noaa.weather.top20stn.csv`

In [12]:
input_data_list[4].head()

,Unnamed: 0,STATION,NAME,LATITUDE,LONGITUDE,ELEVATION,DATE,AWND,AWND_ATTRIBUTES,DAPR,...,WT22_ATTRIBUTES,SN53,SN53_ATTRIBUTES,SX53,SX53_ATTRIBUTES,date,yr,date2,mo,tavg2
0,243,USC00115763,"MONEE RESERVOIR, IL US",41.39355,-87.76438,225.6,2006-01-01,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,2006-01-01,2006,2006-01-01,1,NaN
1,244,USC00115763,"MONEE RESERVOIR, IL US",41.39355,-87.76438,225.6,2006-01-02,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,2006-01-02,2006,2006-01-02,1,NaN
2,245,USC00115763,"MONEE RESERVOIR, IL US",41.39355,-87.76438,225.6,2006-01-03,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,2006-01-03,2006,2006-01-03,1,NaN
3,246,USC00115763,"MONEE RESERVOIR, IL US",41.39355,-87.76438,225.6,2006-01-04,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,2006-01-04,2006,2006-01-04,1,NaN
4,247,USC00115763,"MONEE RESERVOIR, IL US",41.39355,-87.76438,225.6,2006-01-05,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,2006-01-05,2006,2006-01-05,1,NaN

In [13]:
input_data_list[4].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 90077 entries, 0 to 90076
Columns: 114 entries, Unnamed: 0 to tavg2
dtypes: float64(58), int64(3), object(53)
memory usage: 78.3+ MB

# `wnv.trap.date.csv`

In [14]:
input_data_list[5].head()

,Unnamed: 0,trap.name,lat,lng,lat.lng.src,satellite.ind,trap_type,date,erraticus.NumMosquitos,pipiens.NumMosquitos,...,tarsalis.WnvPresent,territans.WnvPresent,unspecified.WnvPresent,any.WnvPresent,mo,wk,day.of.wk,day.of.wk.name,location,yr
0,1,T220A,41.987054,-87.728398,CDPH,True,GRAVID,2008-08-26,0,5,...,False,False,False,True,8,35,3,Mon,"(41.987053811133364,-87.72839753205471)",2008
1,2,T220A,41.987054,-87.728398,CDPH,True,GRAVID,2008-09-02,0,1,...,False,False,False,False,9,36,3,Mon,"(41.987053811133364,-87.72839753205471)",2008
2,3,T220A,41.987054,-87.728398,CDPH,True,GRAVID,2008-09-09,0,0,...,False,False,False,True,9,37,3,Mon,"(41.987053811133364,-87.72839753205471)",2008
3,4,T220A,41.987054,-87.728398,CDPH,True,GRAVID,2008-09-15,0,0,...,False,False,False,False,9,37,2,Sun,"(41.987053811133364,-87.72839753205471)",2008
4,5,T220A,41.987054,-87.728398,CDPH,True,GRAVID,2008-09-19,0,0,...,False,False,False,False,9,38,6,Thu,"(41.987053811133364,-87.72839753205471)",2008

In [15]:
input_data_list[5].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13631 entries, 0 to 13630
Data columns (total 32 columns):
Unnamed: 0                       13631 non-null int64
trap.name                        13631 non-null object
lat                              13631 non-null float64
lng                              13631 non-null float64
lat.lng.src                      13631 non-null object
satellite.ind                    13631 non-null bool
trap_type                        13631 non-null object
date                             13631 non-null object
erraticus.NumMosquitos           13631 non-null int64
pipiens.NumMosquitos             13631 non-null int64
pipiens_restuans.NumMosquitos    13631 non-null int64
restuans.NumMosquitos            13631 non-null int64
salinarius.NumMosquitos          13631 non-null int64
tarsalis.NumMosquitos            13631 non-null int64
territans.NumMosquitos           13631 non-null int64
unspecified.NumMosquitos         13631 non-null int64
tot.NumMosquitos                 13631 non-null int64
erraticus.WnvPresent             13631 non-null bool
pipiens.WnvPresent               13631 non-null bool
pipiens_restuans.WnvPresent      13631 non-null bool
restuans.WnvPresent              13631 non-null bool
salinarius.WnvPresent            13631 non-null bool
tarsalis.WnvPresent              13631 non-null bool
territans.WnvPresent             13631 non-null bool
unspecified.WnvPresent           13631 non-null bool
any.WnvPresent                   13631 non-null bool
mo                               13631 non-null int64
wk                               13631 non-null int64
day.of.wk                        13631 non-null int64
day.of.wk.name                   13631 non-null object
location                         13631 non-null object
yr                               13631 non-null int64
dtypes: bool(10), float64(2), int64(14), object(6)
memory usage: 2.4+ MB

# `wnv.traps.csv`

In [16]:
input_data_list[6].head()

,trap.name,rev.lat,rev.lng,lat.lng.src,satellite.ind,ZCTA5CE10,STATEFP,COUNTYFP,TRACTCE,BLKGRPCE,GEOID,community
0,T220A,41.987054,-87.728398,CDPH,True,60646,17,31,130100,2,170311301002,NORTH PARK
1,T001,41.954282,-87.733843,CDPH,False,60641,17,31,160300,2,170311603002,IRVING PARK
2,T002,41.956299,-87.797517,CDPH,False,60634,17,31,170100,1,170311701001,DUNNING
3,T002A,41.965414,-87.782119,CDPH,True,60630,17,31,150501,1,170311505011,PORTAGE PARK
4,T002B,41.951535,-87.789835,CDPH,True,60634,17,31,170300,1,170311703001,DUNNING

In [17]:
input_data_list[6].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 194 entries, 0 to 193
Data columns (total 12 columns):
trap.name        194 non-null object
rev.lat          194 non-null float64
rev.lng          194 non-null float64
lat.lng.src      194 non-null object
satellite.ind    194 non-null bool
ZCTA5CE10        194 non-null int64
STATEFP          194 non-null int64
COUNTYFP         194 non-null int64
TRACTCE          194 non-null int64
BLKGRPCE         194 non-null int64
GEOID            194 non-null int64
community        194 non-null object
dtypes: bool(1), float64(2), int64(6), object(3)
memory usage: 16.9+ KB